---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.RepresentaionOf3DShapes
source: html/34e9396a-eddd-4213-9384-e1a2be6d0137.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.RepresentaionOf3DShapes Property

Identifies how the Bending Detail will represent the 3D shapes.

## Syntax (C#)
```csharp
public BendingDetailFor3DShapesOptions RepresentaionOf3DShapes { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration